xlyric/pv-router-esp32/src/main.cpp
#include <Arduino.h>
#include "driver/ledc.h"
#include "langues/lang.h"

#include "WiFiClientSecure.h"
#include <ESPmDNS.h>

  #include <driver/adc.h>
  #include "config/config.h"
  #include "config/enums.h"
  #include "config/traduction.h"
  #ifdef S3
  #include "pin_config.h"
  #endif

  #if  NTP
  #include <NTPClient.h>
  #include "tasks/fetch-time-from-ntp.h"
  #endif

#include <ElegantOTA.h>

// File System
#include <FS.h>
#include <Wire.h>  // Only needed for Arduino 1.6.5 and earlier
#include <ArduinoJson.h> // ArduinoJson : https://github.com/bblanchon/ArduinoJson

  #include "tasks/updateDisplay.h"
  #include "tasks/switchDisplay.h"
 
  
  
  #include "tasks/wifi-connection.h"
  #include "tasks/measure-electricity.h"
  
  #include "tasks/Dimmer.h"
 
  #include "tasks/gettemp.h"

  #include "tasks/Serial_task.h"
  #include "tasks/send-mqtt.h"
  #include "tasks/watchdog_memory.h"
  #include "tasks/mDNS.h"
  
  #include "functions/spiffsFunctions.h"
  #include "functions/Mqtt_http_Functions.h"
  #include "functions/webFunctions.h"

  #include "functions/froniusFunction.h"
  #include "functions/enphaseFunction.h"
  #include "functions/WifiFunctions.h"
  #include "functions/homeassistant.h"
  #include "functions/ESP32.h"

  #ifdef WEBSOCKET_CLIENT
  #include "functions/websocket.h"
  #endif

  #include "functions/minuteur.h"

  #include "uptime.h"
  #include <driver/adc.h>

   

// Dallas 18b20
  #include <OneWire.h>
  #include <DallasTemperature.h>
  #include "tasks/dallas.h"
  #include "functions/dallasFunction.h"


/// déclaration dimmer
#include <RBDdimmer.h>   /// the corrected librairy  in RBDDimmer-master-corrected.rar , the original has a bug
#include "functions/unified_dimmer.h"
#include "functions/dimmerFunction.h"

int pwmChannel = 0; //Choisit le canal 0
int frequence = 1000; //Fréquence PWM de 1 KHz
int resolution = 10; // Résolution de 8 bits, 256 valeurs possibles

TaskHandle_t myTaskmdnsdiscovery; // Handle pour suivre la tâche
TaskHandle_t myTaskwatchdogmemory;
TaskHandle_t myTaskkeepwifialive2;
TaskHandle_t myTaskserialreadtask;
TaskHandle_t myTaskupdatedisplay;
TaskHandle_t myTaskdallasread;
TaskHandle_t myTaskswitcholed;
TaskHandle_t myTaskmeasureelectricity;
TaskHandle_t myTaskupdatedimmer;
TaskHandle_t myTasksendtomqtt;

SemaphoreHandle_t mutex;  // Déclaration du mutex


//***********************************
//************* Afficheur Oled
//***********************************
#ifdef  ESP32D1MINI_FIRMWARE
 /// deja intégré dans display.h
#endif

#ifdef  TTGO
#include <TFT_eSPI.h>
#include <SPI.h>
TFT_eSPI display = TFT_eSPI();   // Invoke library
#endif


DisplayValues gDisplayValues;

Config config; 
Configwifi configwifi; 
Configmodule configmodule; 

///déclaration des programmateurs 
Programme programme; 
Programme programme_relay1;
Programme programme_relay2;
Programme programme_marche_forcee;

/// declare logs 
Logs logging;
/// declare MQTT 
Mqtt configmqtt;
/// surveillance mémoire
Memory task_mem; 


int retry_wifi = 0;
void connect_to_wifi();
void handler_before_reset();
void reboot_after_lost_wifi(int timeafterlost);
void IRAM_ATTR function_off_screen();
void IRAM_ATTR function_next_screen();


// Place to store local measurements before sending them off to AWS
unsigned short measurements[LOCAL_MEASUREMENTS]; // NOSONAR
unsigned char measureIndex = 0;

///gestion des tasks
TaskHandle_t serialTaskHandle = NULL;

//***********************************
//************* Dallas
//***********************************

Dallas dallas; 

bool boost();

#ifndef LIGHT_FIRMWARE
    HA device_dimmer; 
    HA device_routeur; 
    HA device_routed; // Ajout envoi MQTT puissance routée totale (local + distants)
    HA device_dimmer_power; // Ajout MQTT envoi puissance du dimmer local
    HA device_grid;
    HA device_inject;
    HA compteur_inject;
    HA compteur_grid;
    HA switch_1;
    HA temperature_HA;
    HA power_factor;
    HA power_apparent;
    HA switch_relay1;
    HA switch_relay2;
    HA device_dimmer_boost;

#endif

/***************************
 *  Dimmer init
 **************************/
/// Déclaration des dimmers
dimmerLamp dimmer1(outputPin, zerocross); //initialase port for dimmer for ESP8266, ESP32, Arduino due boards
#ifdef outputPin2
  dimmerLamp dimmer2(outputPin2, zerocross); //initialase port for dimmer for ESP8266, ESP32, Arduino due boards
  dimmerLamp dimmer3(outputPin3, zerocross); //initialase port for dimmer for ESP8266, ESP32, Arduino due boards
#endif
// déclaration de la gestion des dimmers
gestion_puissance unified_dimmer;

void setup()
{
  #if DEBUG == true
    Serial.begin(115200);
  #endif 
  #if CORE_DEBUG_LEVEL > ARDUHAL_LOG_LEVEL_NONE
    Serial.setDebugOutput(true);
  #endif
  
  Serial.println("\n================== " + String(VERSION) + " ==================");
  logging.Set_log_init("197}11}1");
  logging.Set_log_init("#################  "+ String(Reason_for_reset) +"  ###############\r\n");
  esp_reset_reason_t reason = esp_reset_reason();
  logging.Set_log_init(String(reason).c_str());
  logging.Set_log_init("\r\n#################  "+ String(Starting_System)+ "  ###############\r\n");
  
  //démarrage file system
  Serial.println("start SPIFFS");
  test_fs_version();
  
  logging.Set_log_init(Start_filesystem,true);
  
  if (!SPIFFS.begin(true)) {
    Serial.println("SPIFFS Initialization failed!");
    return;
  }

    #ifdef  ESP32D1MINI_FIRMWARE
    oled.init();
    oled.wait_for_wifi(0);
    #endif

  /// Program & FS size
    // size of the compiled program
    uint32_t program_size = ESP.getSketchSize();

    // size of the file system
    uint32_t file_system_size = SPIFFS.totalBytes();

    // used size of the file system
    uint32_t file_system_used = SPIFFS.usedBytes();

    // free size in the flash memory
    uint32_t free_size = ESP.getFlashChipSize() - program_size - file_system_size + file_system_used;

    Serial.println("Program size: " + String(program_size) + " bytes");
    Serial.println("File system size: " + String(file_system_size) + " bytes");
    Serial.println ("File system used: " + String(file_system_used) + " bytes");
    Serial.println("Free space: " + String(free_size) + " bytes");

