xlyric/pv-router-esp32/src/main.cpp
    pinMode(COOLER, OUTPUT);
    digitalWrite(COOLER, HIGH);

    ledcSetup(pwmChannel, frequence, resolution);
    //ledcAttachPin(outputPin, pwmChannel); // NOSONAR

    #ifdef ESP32D1MINI_FIRMWARE
        pinMode(outputPin2, OUTPUT);
        pinMode(outputPin3, OUTPUT);
        //ledcAttachPin(outputPin2, pwmChannel); // NOSONAR 
        //ledcAttachPin(outputPin3, pwmChannel);  // NOSONAR
    #endif
//**********************************    
/// test ACD 

    adc1_config_width(ADC_WIDTH_BIT_12);
    adc1_config_channel_atten(ADC1_CHANNEL_0,ADC_ATTEN_DB_12);
    adc1_config_channel_atten(ADC1_CHANNEL_3, ADC_ATTEN_DB_12);
    adc1_config_channel_atten(ADC1_CHANNEL_4, ADC_ATTEN_DB_12);
    adc1_config_channel_atten(ADC1_CHANNEL_5, ADC_ATTEN_DB_12);
   

    //***********************************
    //************* Setup -  récupération du fichier de configuration
    //***********************************
  
  // Should load default config if run for the first time
  Serial.println(F("Loading configuration..."));
  config.loadConfiguration();

  // récup des logs
  loadlogs();

  if (configwifi.recup_wifi()){
     
     logging.Set_log_init(Loading_wifi_configuration,true);
       AP=false; 
  } 
  else {
    Serial.println(F("mode AP please configure password before Wifi"));
  }

  configmodule.enphase_present=false; 
  configmodule.Fronius_present=false;

  configmqtt.loadmqtt();
  // vérification que le nom du serveur MQTT est différent de none
  if (strcmp(config.mqttserver,"none") == 0 ) {
    config.mqtt = false; 
  }
  else {
    config.mqtt = true; 
  }
  
  // test if Fronius is present ( and load conf )
  configmodule.Fronius_present = loadfronius(fronius_conf);

  // test if Enphase is present ( and load conf )
  loadenphase(enphase_conf);
 
  /// recherche d'une sonde dallas
  
  Serial.println("start 18b20");
  sensors.begin();
  /// recherche d'une sonde dallas
  dallas.detect = dallaspresent();
  
  // detection d'incohérence entre une dallas précédement détecté et maintenant non détecté
  if (dallas.detect == false && config.dallas_present == true) {
    dallas.detect = true;  // ce qui remontera l'incohérence et la tentative de reconnexion en plus de la protection
    logging.Set_log_init("Dallas précédente non retrouvé au reboot, mise en sécurité\r\n");
    dallas.lost = true;
  }
  // inversement, si présente mais pas noté dans la conf alors on en registre
  if (dallas.detect == true && config.dallas_present == false) {
    config.dallas_present = true; 
    // on sauvegarde la conf
    config.saveConfiguration();
  }
  Serial.println("debugdallas");
  Serial.println(config.dallas_present);
  Serial.println(dallas.detect);
  Serial.println(dallas.lost);

  // Setup the ADC
  adc1_config_channel_atten(ADC1_CHANNEL_0, ADC_ATTEN_DB_12);
  adc1_config_channel_atten(ADC1_CHANNEL_4, ADC_ATTEN_DB_12);
  adc1_config_channel_atten(ADC1_CHANNEL_5, ADC_ATTEN_DB_12);

  #ifdef TTGO
  pinMode(ADC_INPUT, INPUT);
  #endif
  // déclaration switch
  pinMode(RELAY1, OUTPUT);
  pinMode(RELAY2, OUTPUT);
  digitalWrite(RELAY1, HIGH); //correction bug de démarrage en GPIO 0
  digitalWrite(RELAY2, LOW);

///  WIFI INIT
      #ifdef  ESP32D1MINI_FIRMWARE
      oled.wait_for_wifi(1);
      #endif
  connect_to_wifi();
      #ifdef  ESP32D1MINI_FIRMWARE
      oled.wait_for_wifi(2);
      #endif
  // Initialize mDNS ( déclaration du routeur sur le réseau )
  mdns_hello(gDisplayValues.pvname);

  Serial.println(mDNS_Responder_Started);
  Serial.println(gDisplayValues.pvname);
  logging.Set_log_init(mDNS_Responder_Started,true);
  logging.Set_log_init(gDisplayValues.pvname + ".local\r\n",true);


  /* récuperation des info ESP32*/
  ESP32Info espInfo = getESP32Info();
  Serial.println("=== ESP32 Information ===");
  Serial.print("Chip Model: "); Serial.println(espInfo.chipModel);
  Serial.print("Chip Revision: "); Serial.println(espInfo.chipRevision);
  Serial.print("Number of CPU Cores: "); Serial.println(espInfo.chipCores);
  Serial.print("Board Name: "); Serial.println(espInfo.boardName);
  Serial.print("Chip ID: "); Serial.println(espInfo.chipID, HEX);

#if OLED_ON == true
    Serial.println(OLEDSTART);
    // Initialising OLED

    
    #ifdef TTGO

        pinMode(SWITCH,INPUT_PULLUP);
        pinMode(BUTTON_LEFT,INPUT_PULLUP);

        display.init();
        display.setRotation(1);
        
        if (config.flip) {
        display.setRotation(3);
        }

        display.fillScreen(TFT_BLACK); // Black screen fill
        display.setCursor(0, 0, 2);
        display.setTextColor(TFT_WHITE,TFT_BLACK);  display.setTextSize(1);
        display.println(BOOTING);
    #endif
#endif

/// init du NTP
ntpinit(); 

  Dimmer_setup();


   // vérification de la présence d'index.html
  if(!SPIFFS.exists("/index.html.gz")){
    Serial.println(SPIFFSNO);  
    
    logging.Set_log_init(SPIFFSNO,true);
  }

  if(!SPIFFS.exists(config.filename_conf)){
    Serial.println(CONFNO);  
    logging.Set_log_init(CONFNO,true);

  }

/// chargement des conf de minuteries
  Serial.println("Loading minuterie");
  programme.set_name("/dimmer");
  programme.loadProgramme();

  programme_marche_forcee.set_name("/marche_forcee");

  programme_relay1.set_name("/relay1");
  programme_relay1.loadProgramme();

  programme_relay2.set_name("/relay2");
  programme_relay2.loadProgramme();

  // Initialize Dimmer State 
  gDisplayValues.dimmer = 0;

  mutex = xSemaphoreCreateMutex();  // Création du mutex

#if WIFI_ACTIVE == true
  #if WEBSSERVER == true
  //***********************************
	//************* Setup -  demarrage du webserver et affichage de l'oled
	//***********************************
   Serial.println("start Web server");
   call_pages();
  #endif

  // ----------------------------------------------------------------
  // TASK: Connect to WiFi & keep the connection alive.
  // ----------------------------------------------------------------
  /*if (!AP){ // NOSONAR
    xTaskCreate( // NOSONAR
      keepWiFiAlive, // NOSONAR
      "keepWiFiAlive",  // Task name // NOSONAR
      8000,            // Stack size (bytes) // NOSONAR
      NULL,             // Parameter // NOSONAR
      5,                // Task priority // NOSONAR
      NULL          // Task handle // NOSONAR
      
    );  //pdMS_TO_TICKS(30000)// NOSONAR
    } */ // NOSONAR

    // task du watchdog de la mémoire
  /*  
    xTaskCreatePinnedToCore(
      watchdog_memory,
      "watchdog_memory",  // Task name
      4000,            // Stack size (bytes)
      NULL,             // Parameter
      3,                // Task priority
      &myTaskwatchdogmemory ,           // Task handle
      0
    );  
  */ 
  // task de recherche dimmer 
  xTaskCreatePinnedToCore(
      mdns_discovery,
      "mdns_discovery",  // Task name
      3000,            // Stack size (bytes)
      NULL,             // Parameter
      1,                // Task priority
      &myTaskmdnsdiscovery,          // Task handle
      ARDUINO_RUNNING_CORE
    );    // le service est arreté si un dimmer est trouvé ou déjà configuré --> necessite reboot pour rechercher de nouveau


     //// task pour remettre le wifi en route en cas de passage en mode AP
    xTaskCreate(
      keepWiFiAlive2,
      "keepWiFiAlive",  // Task name
      3000,            // Stack size (bytes)
      NULL,             // Parameter
      2,                // Task priority
      &myTaskkeepwifialive2          // Task handle
      
