xlyric/pv-router-esp32/src/main.cpp
    );

    
  #endif

  // ----------------------------------------------------------------
  // TASK: envoie d'information série
  // ----------------------------------------------------------------
   //// la task a un timeout et le mode série ne répond plus après 2 minutes ce qui laisse le temps de faire les reglages wifi sur l'OTA
   xTaskCreate(
      serial_read_task,
      "Serial Read",      // Task name
      3000,            // Stack size (bytes)
      NULL,             // Parameter
      2,                // Task priority
      &myTaskserialreadtask             // Task handle
    );  /// le service est arreté après 2 minutes


  // ----------------------------------------------------------------
  // TASK: Update the display every second
  //       This is pinned to the same core as Arduino
  //       because it would otherwise corrupt the OLED
  // ----------------------------------------------------------------
  #if OLED_ON == true
      #ifdef  ESP32D1MINI_FIRMWARE
      Serial.println("init oled 0.7'' ");
      init_ui();
      #endif
  #endif

#if OLED_ON == true 
xTaskCreate(
    updateDisplay,
    "UpdateDisplay",  // Task name
    3500,            // Stack size (bytes)
    NULL,             // Parameter
    2,                // Task priority
    &myTaskupdatedisplay           // Task handle

  );  
#endif

  if (dallas.detect) {
    // ----------------------------------------------------------------
    // Task: Read Dallas Temp
    // ----------------------------------------------------------------
    xTaskCreate(
      dallasread,
      "Dallas local temp",  // Task name
      4000,                  // Stack size (bytes)
      NULL,                   // Parameter
      2,                      // Task priority
      &myTaskdallasread       // Task handle
    ); 
  }


#ifdef  TTGO
  // ----------------------------------------------------------------
  // Task: Update Dimmer power
  // ----------------------------------------------------------------
  #ifndef ESP32D1MINI_FIRMWARE
    attachInterrupt(SWITCH, function_off_screen, FALLING);
    attachInterrupt(BUTTON_LEFT, function_next_screen, FALLING);

  xTaskCreate( 
    switchDisplay,
    "Swith Oled",  // Task name
    3000,                  // Stack size (bytes)
    NULL,                   // Parameter
    2,                      // Task priority
    &myTaskswitcholed                    // Task handle
  ); 
  #endif
#endif



  // ----------------------------------------------------------------
  // Task: measure electricity consumption ;)
  // ----------------------------------------------------------------
   xTaskCreate(
    measureElectricity,
    "Measure electricity",  // Task name
    5000,                  // Stack size (bytes)
    NULL,                   // Parameter
    4,                      // Task priority
    &myTaskmeasureelectricity                    // Task handle
  );  

#if WIFI_ACTIVE == true
  #if DIMMER == true
  // ----------------------------------------------------------------
  // Task: Update Dimmer power
  // ----------------------------------------------------------------
   
  xTaskCreatePinnedToCore(
    updateDimmer,
    "Update Dimmer",  // Task name
    4000,                  // Stack size (bytes)
    NULL,                   // Parameter
    4,                      // Task priority
    &myTaskupdatedimmer  ,                  // Task handle
    ARDUINO_RUNNING_CORE
  );
  
  // ----------------------------------------------------------------
  // Task: Get Dimmer temp
  // ----------------------------------------------------------------
  if (!dallas.detect) {
    xTaskCreatePinnedToCore(
        GetDImmerTemp,
        "Update temp",  // Task name
        4000,                  // Stack size (bytes)
        NULL,                   // Parameter
        2,                      // Task priority
        NULL,                  // Task handle
        ARDUINO_RUNNING_CORE
      );  
  }

// ----------------------------------------------------------------
  // Task: MQTT send
  // ----------------------------------------------------------------

  xTaskCreatePinnedToCore(
    send_to_mqtt,
    "Update MQTT",  // Task name
    4500,                  // Stack size (bytes)
    NULL,                   // Parameter
    2,                      // Task priority
    &myTasksendtomqtt,                  // Task handle
    ARDUINO_RUNNING_CORE
  );  

  #endif

#endif


#if WIFI_ACTIVE == true


      #if WEBSSERVER == true
        ElegantOTA.begin(&server);
        server.begin(); 
      #endif
  #ifndef LIGHT_FIRMWARE
      if (!AP) {
          if (config.mqtt) {
            Mqtt_init();

          // HA autoconf
          if (!client.connected() && (WiFi.status() == WL_CONNECTED )) { reconnect(); delay (1000);}
          if (configmqtt.HA) init_HA_sensor();
            
          }
      }
  #endif

    gDisplayValues.dimmer = 0; 
    dimmer_change( config.dimmer, config.IDXdimmer, gDisplayValues.dimmer,0 ) ; 


#endif

esp_register_shutdown_handler( handler_before_reset );

logging.power=true; logging.sct=true; logging.sinus=true; 

/// affichage de l'heure  GMT +1 dans la log
logging.Set_log_init(End_Start,true);

savelogs(" -- fin du précédent reboot -- ");

/// envoie de l'info de reboot
constexpr const int bufferSize = 150; // Taille du tampon pour stocker le message
char raison[bufferSize];     
snprintf(raison, bufferSize, "restart : %s", logging.loguptime()); 
#ifndef LIGHT_FIRMWARE 
  client.publish("memory/Routeur", raison, true);
#endif
#ifdef WEBSOCKET_CLIENT
setupWebSocket(); // initialisation du socket web
#endif

programme_marche_forcee.temperature = config.tmax;
}

// @multinet33 : c'est un peu crade ;) 
void myTask(void *pvParameters) {
    while (1) {
        Serial.print("Stack disponible : ");
        Serial.println(uxTaskGetStackHighWaterMark(NULL)); // Vérifie la pile de cette tâche
        vTaskDelay(1000 / portTICK_PERIOD_MS); // Pause 1 seconde
    }
}

//#define DEBUGLEVEL1
/// @brief / Loop function
void loop()
{

#ifdef DEBUGLEVEL1
  // Function to check stack for a specific task and print the result
  auto printTaskStack = [](TaskHandle_t taskHandle, const char* taskName) {
    if (taskHandle != NULL) {
      Serial.print("Stack min restante de ");
      Serial.print(taskName);
      Serial.print(" : ");
      Serial.println(uxTaskGetStackHighWaterMark(taskHandle));
    }
  };
  
  // Check stack space for all tasks
  //printTaskStack(myTaskmdnsdiscovery, "myTaskmdnsdiscovery"); // la tache s'arrete 
  printTaskStack(myTasksendtomqtt, "myTasksendtomqtt");
  printTaskStack(myTaskupdatedimmer, "myTaskupdatedimmer");
  printTaskStack(myTaskmeasureelectricity, "myTaskmeasureelectricity");
  printTaskStack(myTaskswitcholed, "myTaskswitcholed");
  printTaskStack(myTaskdallasread, "myTaskdallasread");
  printTaskStack(myTaskupdatedisplay, "myTaskupdatedisplay");
  //printTaskStack(myTaskserialreadtask, "myTaskserialreadtask"); // la tache s'arrete
  printTaskStack(myTaskkeepwifialive2, "myTaskkeepwifialive2");
  printTaskStack(myTaskwatchdogmemory, "myTaskwatchdogmemory");
#endif

  
  


  #ifdef WEBSOCKET_CLIENT
  //handleWebSocket(); // Keep the WebSocket connection alive
  webSocket.loop();
  #endif
//// si perte du wifi après  6h, reboot
  if (AP) {
    reboot_after_lost_wifi(6);
  }

