xlyric/pv-router-esp32/src/main.cpp
/// redémarrage sur demande
  if (config.restart) {

    Serial.print(PV_RESTART);
    savelogs("-- reboot demande par l'utilisateur -- ");
    ESP.restart();
  }


   ///  vérification de la tailld du buffer log_init ( 600 caractères max ) il est créé à 650 caractères ( enums.h )
   /// pour éviter les buffer overflow et fuite mémoire. 
  logging.clean_log_init();
// affichage en mode serial de la taille de la chaine de caractère logging.log_init



// vérification de la connexion wifi 
  if ( WiFi.status() != WL_CONNECTED ) {
      connect_to_wifi();
      }
    
  if (AP) {
    int number_client = WiFi.softAPgetStationNum(); // Nombre de stations connectées à ESP8266 soft-AP
    if (number_client == 0 ) {
      if (retry_wifi == 10 ) {
        retry_wifi = 0;
        connect_to_wifi();
      }
      if (retry_wifi < 10 ) {
        retry_wifi ++;
      }

    }
  }

if (config.dimmerlocal) {
  ///////////////// gestion des activité minuteur 
  //// Dimmer 
    Serial.println(unified_dimmer.get_power());
    if (programme.run || programme_marche_forcee.run) { 
        //  minuteur en cours
        if (programme.stop_progr() || programme_marche_forcee.stop_progr() ) { 

            unified_dimmer.dimmer_off("minuteur"); 
            unified_dimmer.set_power(0); 
            if (dallas.detect) {
            dallas.security=true;
            }

          DEBUG_PRINTLN("programme.run");
          Serial.println("stop minuteur dimmer");
          //arret du ventilateur
          digitalWrite(COOLER, LOW);
          /// retrait de la securité dallas
          
          // on remet les valeurs de temps programme_marche_force à 00:00
          strcpy(programme_marche_forcee.heure_demarrage, "00:00"); // NOSONAR
          strcpy(programme_marche_forcee.heure_arret, "00:00");  // NOSONAR
          
          /// remonté MQTT
          #ifndef LIGHT_FIRMWARE
            if (xSemaphoreTake(mutex, portMAX_DELAY)) { 
              Mqtt_send(String(config.IDX), String(unified_dimmer.get_power()),"pourcent"); // remonté MQTT de la commande réelle
              if (configmqtt.HA) {
                int instant_power = unified_dimmer.get_power();
                device_dimmer.send(String(instant_power * config.charge/100));
              } 
              xSemaphoreGive(mutex);
            }
          #endif
        } 
    } 
    else { 
      // minuteur à l'arret
      if (programme.start_progr() ||  programme_marche_forcee.start_progr() ){ 
        int sysvar_puissance; 
        if ( programme.puissance > config.localfuse ) {     sysvar_puissance=config.localfuse; }
        else { sysvar_puissance = programme.puissance; } 

        unified_dimmer.set_power(sysvar_puissance);
        delay (50);
        Serial.println("start minuteur ");
        //demarrage du ventilateur 
        digitalWrite(COOLER, HIGH);
        
        /// remonté MQTT
        #ifndef LIGHT_FIRMWARE
        if (xSemaphoreTake(mutex, portMAX_DELAY)) {
          Mqtt_send(String(config.IDX), String(unified_dimmer.get_power()),"pourcent"); // remonté MQTT de la commande réelle
            if (configmqtt.HA) {
              int instant_power = unified_dimmer.get_power();
              device_dimmer.send(String(instant_power * config.charge/100));
              if ( programme_marche_forcee.run) {
                device_dimmer_boost.send("1");
              }
            } 
            xSemaphoreGive(mutex);
          }
        #endif
      }
    }
}

if (programme_relay1.run) { 
      if (programme_relay1.stop_progr()) { 
        logging.Set_log_init(Stop_minuteur_relay1,true);
        digitalWrite(RELAY1 , HIGH); //correction bug de démarrage en GPIO 0
      }
 }
 else {
      if (programme_relay1.start_progr()){ 
        logging.Set_log_init(Start_minuteur_relay1,true);
        digitalWrite(RELAY1 , LOW); //correction bug de démarrage en GPIO 0
      }
 }

 if (programme_relay2.run) { 
      if (programme_relay2.stop_progr()) { 
        logging.Set_log_init(Stop_minuteur_relay2,true);
        digitalWrite(RELAY2 , LOW);
      }
 }
 else {
      if (programme_relay2.start_progr()){ 
        logging.Set_log_init(Start_minuteur_relay2,true);
        digitalWrite(RELAY2 , HIGH);
      }
 }

/// fonction de reboot hebdomadaire ( lundi 00:00 )

if (!AP) {
    time_reboot();
}

  //// protection contre l'absence de commande  
  if ( !programme.run && !programme_marche_forcee.run ) { 
    unified_dimmer.auto_off(AUTO_OFF);
  }
  
  task_mem.task_loop = uxTaskGetStackHighWaterMark(nullptr);
  vTaskDelay(pdMS_TO_TICKS(10000));
}

/// @brief / end Loop function


void connect_to_wifi() {
  ///// AP WIFI INIT 
   
  if (AP || strcmp(configwifi.SID,"AP") == 0 ) {
      APConnect(); 
      gDisplayValues.currentState = DEVICE_STATE::UP;
      gDisplayValues.IP = String(WiFi.softAPIP().toString());
      btStop();
      return; 
  }
  else {
      #if WIFI_ACTIVE == true
      WiFi.mode(WIFI_STA);
      WiFi.setSleep(false);
      WiFi.begin(configwifi.SID, configwifi.passwd); 
      int timeoutwifi=0;
      
      logging.Set_log_init(Start_Wifi_Network,true);
      logging.Set_log_init(configwifi.SID);
      logging.Set_log_init("\r\n");
      
      while ( WiFi.status() != WL_CONNECTED ) {
        delay(500);
        Serial.print(".");
        timeoutwifi++; 

        if (timeoutwifi > 40 ) {
              
              logging.Set_log_init(timeout_AP_mode,true);
              
              logging.Set_log_init(Wifi_State,true);
              logging.Set_log_init("",true);
              
              switch (WiFi.status()) {
                  case 1:
                      logging.Set_log_init("SSID is not available");
                      break;
                  case 4:

                      logging.Set_log_init("The connection fails for all the attempts");
                      break;
                  case 5:
                      logging.Set_log_init("The connection is lost");
                      break;
                  case 6:
                      logging.Set_log_init("Disconnected from the network");
                      break;
                  default:
                      break;
          
              logging.Set_log_init("\r\n");
              } 
              break;
        }
    }

        //// timeout --> AP MODE 
        if ( timeoutwifi > 40 ) {
              WiFi.disconnect(); 
              serial_println(timeout_AP_mode);
              
