xlyric/pv-router-esp32/src/main.cpp
              gDisplayValues.currentState = DEVICE_STATE::UP;
              APConnect(); 
        }


      serial_println(Wifi_connected);
      logging.Set_log_init(Wifi_connected,true);
      serial_println("IP address: ");
      serial_println(WiFi.localIP());
        serial_print(signal_level);
        serial_print(WiFi.RSSI());
        serial_println("dBm");
      gDisplayValues.currentState = DEVICE_STATE::UP;
      gDisplayValues.IP = String(WiFi.localIP().toString());
      btStop();
      #endif
  }
}




void handler_before_reset() {
  #ifndef LIGHT_FIRMWARE
  const int bufferSize = 150; // Taille du tampon pour stocker le message
  char raison[bufferSize];

  snprintf(raison, bufferSize, "reboot handler: %s ",logging.loguptime()); 
  
  client.publish("memory/Routeur", raison, true);
  #endif
}

void reboot_after_lost_wifi(int timeafterlost) {
  uptime::calculateUptime();
  if ( uptime::getHours() > timeafterlost ) { 
    delay(15000);  
    config.restart = true; 
  }
}

void IRAM_ATTR function_off_screen() {
  gDisplayValues.screenbutton = true;
}

void IRAM_ATTR function_next_screen(){
  gDisplayValues.nextbutton = true;
  gDisplayValues.option++; 
  if (gDisplayValues.option > 2 ) { gDisplayValues.option = 1 ;}; 
}

bool boost(){
    time_t now = time(nullptr);
    if (programme_marche_forcee.run) {

      // sur bug avec mqtt, on fait differement : on change l'heure de fin pour mettre à maintenant
      strftime(programme_marche_forcee.heure_arret, 6, "%H:%M", localtime(&now));
      now += TIME_BOOST;
      strftime(programme_marche_forcee.heure_demarrage, 6, "%H:%M", localtime(&now));
      return false;
    }
    
    // programation de l'heure de démarrage
    strftime(programme_marche_forcee.heure_demarrage, 6, "%H:%M", localtime(&now));
    // ajout de 2h
    now += TIME_BOOST;
    // programmaton de l'heure d'arrêt
    strftime(programme_marche_forcee.heure_arret, 6, "%H:%M", localtime(&now));
    // ajout de la température de consigne
    programme_marche_forcee.temperature = config.tmax;
    programme_marche_forcee.puissance = programme.puissance;
    return true;
} 
